<?php
//Gets the absolute path from relative path
/*Ще го превърне само в истински ако файлът съществува или ще върне false
 *Всеки път когато създаваме файл в файловата система, който е генериран с някакви параметри от потребителя
 *било то GET, POST, COOKIE - задължително трябва да го прекараме през realpath(), за да видим дали всичко е наред
 */
echo realpath('data.txt') . '<br>';

//Проверяваме дали фалът съдържа ./ или ../ , за да знаем дали потребителя се опитва да манипулира системата
//и ако е така вадим грешка и правим изход от продграмата

$path = 'data.txt';
if ( stripos($path, './') !== false || stripos($path, '../') !== false) {
    echo 'error' . PHP_EOL;
    exit;
}
else {
    echo "path seems legit" . '<br>';
}
// Ако тази проверка мине тогава вече минаваме през realpath() проверката и продължаваме с програмата

//Релативният път не винаги сочи към файла, който Include-ваме, защото той може да se include-ва от друг и тн
//Затова може да вземем пътя до определения файл с __FILE__ константата

echo __FILE__ . '<br>';


